import CtaButton from "@/components/ui/CTAButton";

export default function DarshanAboutSection() {
  return (
    <section className="w-full py-16 xl:py-24 px-4 xl:px-60 bg-(--color-bg-1)">
      <div className="container">
        <div className="text-center px-4 xl:px-36">
          {/* TITLE */}
          <h2>दर्शन के बारे में</h2>

          {/* DESCRIPTION */}
          <div className="mt-4 space-y-6 body-lg w-full">
            <p>
              मध्यस्थ दर्शन सह-अस्तित्ववाद श्री ए. नागराज (1919–2016) का कार्य
              है, जिन्होंने अपना जीवन वास्तविकता और मानव उद्देश्य की खोज में
              समर्पित किया। उनके आत्मसाक्षात्कार ने स्पष्ट किया कि सह-अस्तित्व
              ही मूलभूत वास्तविकता है, जो मानव आचरण, संबंधों और न्यायपूर्ण समाज
              की व्यवस्थाओं पर स्पष्टता प्रदान करता है।
            </p>

            <p>
              मध्यस्थ दर्शन सह-अस्तित्ववाद श्री ए. नागराज (1919–2016) का कार्य
              है, जिन्होंने अपना जीवन वास्तविकता और मानव उद्देश्य की खोज में
              समर्पित किया। उनके आत्मसाक्षात्कार ने स्पष्ट किया कि सह-अस्तित्व
              ही मूलभूत वास्तविकता है, जो मानव आचरण, संबंधों और न्यायपूर्ण समाज
              की व्यवस्थाओं पर स्पष्टता प्रदान करता है।
            </p>

            <p>
              सह-अस्तित्ववाद केवल दार्शनिक चिंतन नहीं है, बल्कि यह व्यावहारिक
              मार्गदर्शन देता है कि किस प्रकार व्यक्ति, परिवार, समाज और प्रकृति
              के साथ सामंजस्य स्थापित कर सकता है श्री नागराज जी का मानना था कि
              मानव जीवन का वास्तविक उद्देश्य केवल भौतिक समृद्धि नहीं, बल्कि
              संपूर्णता की अनुभूति और सभी के साथ संतुलित सह-अस्तित्व है। उनका यह
              दर्शन शिक्षा, राजनीति, अर्थव्यवस्था और संस्कृति—सभी क्षेत्रों में
              स्थायी समाधान की दिशा प्रदान करता है।
            </p>
          </div>

          {/* CTA */}
          <div className="mt-12 flex justify-center">
            <CtaButton
              text="दर्शन समझें"
              bgColor="var(--color-primary)"
              textColor="black"
              size="md"
            />
          </div>
        </div>
      </div>
    </section>
  );
}
